[
- {
id: "27",
ip: "154.122.6.12",
spec_id: "Ppal_Project_554f93bd758b1_1431278525",
type: "2",
zipped_file_name: "Ppal_Project_554f93bd758b1_1431278525.zip",
project_title: "Challenges facing Organizations in retaining generation Y employees",
category_id: "9",
course_id: "39",
user_id: "27",
description: "INTRODUCTION The entrance of Generation Y in the workplace has proved a hard nut to crack as they have formed a habit of job-hopping and not working for more than three years and as a result difficult in retaining in organizations. This has been caused by what they call lack of progress at work. They expect to be promoted after a short while without which they have internet access which provides job listings in just a keystroke making it easier for them to find other job options. Another origin of this problem is the fear about the future and a belief that companies have no loyalty to their employees. This Generation watched as people in their parents’ Generation were retrenched after many years of service in the same company, with many going home with a pittance and they are not ready to go through that path as well. The fear of getting laid off also alludes to this habit. This Generation is aware that if there is a business slump or merger, they may be laid off and yet they know that their economic survival depends on maintaining cutting –edge skills, so they do not feel guilty jumping ship if another job offers better pay or more growth opportunity. The rule on how long employees stay in organization has been changed knowingly or unknowingly by employers thus in favour of this Generation as they respond to the demand in the market created by employers. The trend of job hopping is also traced at the point whereby the graduates grab their first job that comes along just to earn a living and then they keep hopping from one job to another until they find a job of their interest and that guarantees quick success and money. Click purchase to get the full documentation",
keywords: "Y employees",
screen_shot: "",
languages: "",
approved: "1",
paid: "2"	
,fee: "500",
views: "32",
date_uploaded: "10/05/2015 20:22:05",
course_name: "Bachelor of Commerce(Finance option)",
date_saved: "28/04/2015 08:52:48",
category: "Business",
verify_code: "35400",
user_level: "2",
fname: "Moses",
lname: "Nderi",
dob: "19/9/1990",
gender: "Male",
email: "monderiee@gmail.com",
password: "$2yKES 974.04 ($10)$hVCtD/0EZe5lI7k1DMYjhe1SPEz8pjmniIVRjxdE.pd1ikHsRJx4S",
phone: "+254702966244",
address: "juja",
id_no: "28508635",
bank_name: "Equity Limited Bank",
bank_branch: "Mwea",
bank_account_number: "2147483647",
thumbnail: "t0fnsudpzpk30_had1q_2mr_zjmi_cd.jpg",
active: "1",
user_folder_name: "Moses-Nderi",
last_update: "25/05/2015 22:18:31"
}
]
Format online